# DentalYOLO26 v4 - 3-scale YOLO26 with P2 detail injection, BiFPN-lite fusion,
# large-kernel depthwise context, P3-focused head, and light ECA in C3k2 blocks.

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  - [-1, 2, C3k2ECA, [256, False, 0.25]]         # 2 P2 detail
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8
  - [-1, 2, C3k2ECA, [512, False, 0.25]]         # 4
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 2, C3k2ECA, [512, True]]                # 6
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 2, C3k2ECA, [1024, True]]               # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]            # 9
  - [-1, 1, LargeKernelDWContext, [1024, 7]]     # 10
  - [-1, 2, C2PSA, [1024]]                       # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPNLite, [512]]               # 13 P4 top-down fusion
  - [-1, 2, C3k2ECA, [512, True]]                # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [2, 1, Conv, [256, 3, 2]]                    # 16 P2 -> P3 detail injection
  - [[15, 4, 16], 1, BiFPNLite, [320]]           # 17 P3-focused fusion
  - [-1, 2, C3k2ECA, [320, True]]                # 18 P3/8-small

  - [-1, 1, Conv, [320, 3, 2]]                   # 19
  - [[-1, 14, 6], 1, BiFPNLite, [512]]           # 20 P4 bottom-up fusion
  - [-1, 2, C3k2ECA, [512, True]]                # 21
  - [-1, 1, LargeKernelDWContext, [512, 7]]      # 22 P4 context

  - [-1, 1, Conv, [512, 3, 2]]                   # 23
  - [[-1, 11], 1, BiFPNLite, [1024]]             # 24 P5 fusion
  - [-1, 1, C3k2ECA, [1024, True, 0.5, True]]    # 25
  - [-1, 1, LargeKernelDWContext, [1024, 7]]     # 26 P5 context

  - [[18, 22, 26], 1, Detect, [nc]]              # 27 Detect(P3, P4, P5)
