# DentalYOLO26 v6 - optimized v4-lite.
# Keeps the useful dental-oriented ideas from v4 while reducing inference cost:
# - P2 detail injection into P3, but no P2 Detect head.
# - One BiFPN-lite fusion only at P3 where fine details matter most.
# - One large-kernel depthwise context block at P5 after SPPF.
# - ECA only in the head, not across the full backbone.

# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2 P2 detail source
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                   # 6
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]            # 9
  - [-1, 1, LargeKernelDWContext, [1024, 7]]     # 10 cheap P5 context
  - [-1, 2, C2PSA, [1024]]                       # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13 cat backbone P4
  - [-1, 2, C3k2, [512, True]]                   # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [2, 1, Conv, [256, 3, 2]]                    # 16 P2 -> P3 detail injection
  - [[15, 4, 16], 1, BiFPNLite, [256]]           # 17 P3 detail-aware fusion
  - [-1, 2, C3k2ECA, [256, True]]                # 18 P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 14], 1, Concat, [1]]                   # 20 cat head P4
  - [-1, 2, C3k2ECA, [512, True]]                # 21 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 11], 1, Concat, [1]]                   # 23 cat head P5
  - [-1, 1, C3k2ECA, [1024, True, 0.5, True]]    # 24 P5/32-large

  - [[18, 21, 24], 1, Detect, [nc]]              # 25 Detect(P3, P4, P5)
